Repository: thebatinarkham/xam-ui
Catalog: Grial UI Kit for Xamarin Forms 3 Full/AppName/ViewModels/DemoApp/Resx/DemoAppResources.*.resx
Languages: ar

# WalkthroughGradientPageDescription
source: A simple but visually appealing walkthrough that calls to action.
ar: جولة بسيطة ولكنها جذابة بصريًا تستدعي اتخاذ إجراء.

# WalkthroughImagePageDescription
source: This is a simply designed Walkthrough sample. It just displays an image, a description, and a button.
ar: هذه عينة تجول تم تصميمها ببساطة. يعرض فقط صورة وصفًا وزرًا.

# WalkthroughMinimalPageDescription
source: Give instant feedback to app users. Change the message and it will be ready to use in any app.
ar: تقديم ملاحظات فورية لمستخدمي التطبيق. غيّر الرسالة وسيكون جاهزًا للاستخدام في أي تطبيق.

# PopupsPageDescription
source: A complete set of Pop Up designs to include in your app. From user feedback to multiple choice forms.
ar: مجموعة كاملة من تصميمات Pop Up لتضمينها في تطبيقك. من ملاحظات المستخدم إلى نماذج الاختيار من متعدد.

# ShippingDetailPageDescription
source: A beautifully presented list of tasks and related data. This page uses Grial Data Grid control and Grial Custom Tab Control.
ar: قائمة معروضة بشكل جميل من المهام والبيانات ذات الصلة. تستخدم هذه الصفحة تحكم Grial Data Grid والتحكم في علامة التبويب Grial المخصصة.

# TaskBrowserPageDescription
source: A clean visualization of tasks grouped into projects and workspaces. This page uses Charts for task completion evolution, the Grial Custom Tab Control and Grial Card Views.
ar: رؤية نظيفة للمهام مجمعة في المشاريع ومساحات العمل. تستخدم هذه الصفحة مخططات لتطور إكمال المهمة ، و Grial Custom Tab Control و Grial Card View.

# TaskOverviewPageDescription
source: A nice visualization of people performance related to tasks. This page uses Charts and Grial Card Views.
ar: تصور جميل لأداء الأشخاص المرتبط بالمهام. تستخدم هذه الصفحة المخططات البيانية و Grial Card.

# FeatureRtlInvite
source: Please try the RTL button on top to see the app with a right-to-left layout.
ar: يرجى تجربة زر LTR في الأعلى لمشاهدة التطبيق من خلال التنسيق من اليسار إلى اليمين.

# FeatureI18nInvite
source: Please try the RTL button on top to see the app in arabic!
ar: يرجى محاولة زر LTR في الأعلى لرؤية التطبيق باللغة الإنجليزية!

# FeatureI18nDescription
source: Grial based apps are localizable by default, which means they support different languages effortlessly. We provide a XAML markup extension to consume strings from RESX files and runtime options to change the app language.
ar: التطبيقات المستندة إلى Grial قابلة للتخصيص افتراضيًا ، مما يعني أنها تدعم لغات مختلفة دون بذل أي جهد. نحن نوفر تمديد XAML لتستهلك السلاسل من ملفات RESX وخيارات وقت التشغيل لتغيير لغة التطبيق.

# FeatureRTLDescription
source: All pages come with support for right-to-left languages with the same XAML code. Yes! A single XAML codebase that works for both LTR and RTL with no duplicated chunks of code, conditional visibilities or other complexities. We also provide the option to change the layout direction at runtime as a user preference.
ar: تأتي جميع الصفحات مع دعم للغات التي تُكتب من اليمين إلى اليسار باستخدام نفس شفرة XAML. نعم فعلا! شفرة أكواد XAML واحدة تعمل لكل من LTR و RTL مع عدم وجود أجزاء مكررة من الشفرة أو الرؤية الشرطية أو التعقيدات الأخرى. كما نقدم أيضًا خيار تغيير اتجاه التنسيق في وقت التشغيل باعتباره تفضيل المستخدم.

# FeatureDataGridDescription
source: Display tabular data with our cross-platform Data Grid. Easily customize its look and feel through XAML properties such as odd row color, header background color, etc., or go deeper into customization using templates for cells, columns, headers, etc. It allows sorting and selection.
ar: عرض البيانات المجدولة مع شبكة البيانات عبر الأنظمة الأساسية الخاصة بنا. بسهولة تخصيص مظهرها وشعورها من خلال خصائص XAML مثل لون الصف الغريب ، لون خلفية الرأس ، وما إلى ذلك ، أو التعمق في التخصيص باستخدام قوالب للخلايا ، والأعمدة ، والرؤوس ، وما إلى ذلك. وهو يتيح الفرز والاختيار.

# FeatureCardViewDescription
source: One of the most used mobile UI patterns now simplified and available for Xamarin Forms through XAML. Define the shadow color, shadow blur, and corner radius, set the background color and use it as a container for any of your contents.
ar: واحدة من أنماط واجهة المستخدم المحمولة الأكثر استخداما الآن مبسطة في استخدامها ومتاحة ل Xamarin Forms من خلال XAML. حدد لون الظل وظلال الظل ونصف قطر الزاوية ، واضبط لون الخلفية واستخدمه كحاوية لأي من محتوياتك.

# FeatureVideoPlayerDescription
source: A complete cross-platform video player available in Xamarin Forms and fully skinnable through XAML. You can use it as a background for your page, or simply to show a video feed. Easily reproduce local or remote videos in a variety of formats including Youtube.
ar: مشغل فيديو كامل عبر منصة متوفرة في Xamarin Forms و skinnable بالكامل من خلال XAML. يمكنك استخدامه كخلفية كاملة لصفحتك لدمجها مع شريط التنقل الجديد ، أو ببساطة لعرض خلاصة مقاطع الفيديو. يمكنك إعادة إنتاج مقاطع الفيديو المحلية أو البعيدة بسهولة بتنسيقات متنوعة بما في ذلك مقاطع فيديو YouTube.

# FeaturePopupsDescription
source: A full collection of beautiful dialogs and pop-us made in XAML, fully customizable and themeable. It covers the most typical use cases such as: notifications, user feedback, irregular dialogs, custom action sheets, and more.
ar: مجموعة كاملة من الحوارات الجميلة و pop-us صنع في XAML ، قابل للتخصيص بالكامل وقابلية للتشغيل. ويغطي حالات الاستخدام الأكثر شيوعًا مثل: الإشعارات ، وتعليقات المستخدمين ، ومربعات الحوار غير النظامية ، وأوراق الإجراءات المخصصة ، وما إلى ذلك.

# FeatureCarouselViewDescription
source: Display a collection of subviews in your page through the Carousel View. It is fully customizable and supports progressive animations allowing to change your content on user drag events, enabling rich UIs for your app that your users will enjoy.
ar: عرض مجموعة من المقدمات الفرعية في صفحتك من خلال عرض Carousel. وهي قابلة للتخصيص بالكامل وتدعم الرسوم المتحركة التقدمية التي تسمح بتغيير المحتوى الخاص بك على أحداث السحب أو التمرير أو المسح السريع للمستخدم ، مما يؤدي إلى إنشاء تطبيقات UX الغنية والجذابة لتطبيقك الذي سيستمتع به المستخدمون.

# FeatureAnimationsViewDescription
source: Easily incorporate our animations API and add life to your app. Create lovely and engaging UXs on user scroll. Translate or rotate items, change their colors, fade and scale them to achieve outstanding parallax effects. The combinations are infinite, and your users will love your app.
ar: يمكنك بسهولة دمج واجهة برمجة تطبيقات الرسوم المتحركة وإضافة الحياة إلى تطبيقك. إنشاء واجهات UX جميلة وجذابة على التمرير المستخدم. ترجمة العناصر أو تدويرها ، وتغيير ألوانها وتلاشيها وتوسيع نطاقها لتحقيق تأثيرات المنظر المعلقة.المجموعات لا نهائية ، وسيحب مستخدموك تطبيقك.

# FeatureGradientsViewDescription
source: A great new addition to allow further styling and customization of your app. No need to create images. Linear and radial gradients are now available in XAML through our expressive API: define the colors, color stops, opacity, angles, relative or absolute positioning in a similar fashion as in CSS.
ar: إضافة جديدة رائعة للسماح بمزيد من التصميم والتخصيص لتطبيقك. لا حاجة لإنشاء صور إضافية. التدرجات الخطية والشعاعية متاحة الآن في XAML من خلال واجهة برمجة التطبيقات المعبّرة: تحديد الألوان ، توقف اللون ، التعتيم ، الزوايا ، الموضع النسبي أو المطلق بطريقة مماثلة في CSS.

# FeatureGrialNavbarViewDescription
source: One of the most requested features for Xamarin Forms finally is here: now you can make your navigation bar fully transparent, or simulate a taller bar. You can combine its power by using our new XAML gradients and animations to make gorgeous and engaging UIs.
ar: وأخيرًا ، تتمثل إحدى الميزات الأكثر طلبًا لنماذج Xamarin في: هنا ، يمكنك الآن جعل شريط التنقل شفافًا تمامًا وجعل تطبيقك يشبع الشاشة تمامًا. يمكنك الجمع بين قوتها من خلال استخدام التدرجات والرسوم المتحركة الجديدة لـ XAML لإنشاء واجهات مستخدم رائعة وجذابة.

# FeatureCheckboxesAndRadiosDescription
source: Complete your UI interaction needs in Xamarin Forms by including single and multiple user selection through checkboxes and radios with fully customizable XAML templates. Change colors, styles, sizes to suit your needs. Take your data forms pages to the next level.
ar: أكمل احتياجات التفاعل في واجهة المستخدم في نماذج Xamarin من خلال تضمين اختيار واحد ومتعدد المستخدمين من خلال قوالب XAML القابلة للتخصيص بالكامل. تغيير الألوان والأنماط والأحجام لتناسب احتياجاتك. اجمعها مع جهاز إعادة الإرسال لديك للحصول على تفاعلات قوية في صفحات نماذج البيانات.

# FeatureTabControlDescription
source: Switch views inside your page easily by alternating content visibility. Default look and feel matching Android and iOS and their native positioning. Fully customizable appearance through XAML templates and styles. Icon support. Full width or AutoScrollable, no matter how many tabs you add they will scroll automatically.
ar: تبديل العروض داخل صفحتك بسهولة. رؤية محتوى بديلة على نفس الصفحة. المظهر والأسلوب الافتراضيان اللذان يتطابقان مع نظامي التشغيل Android و iOS وموقعهما الأصلي. مظهر قابل للتخصيص بالكامل من خلال قوالب وأنماط XAML. دعم أيقونة بجانب التصنيفات. العرض الكامل أو AutoScrollable ، بغض النظر عن عدد علامات التبويب التي تضيفها ، فسوف يتم التمرير تلقائيًا.

# FeatureRepeaterDescription
source: A layout that allows repeating content inside. It supports bindings, data templates, horizontal and vertical orientation, items selection and virtualization.
ar: تخطيط يسمح بتكرار المحتوى بداخله. وهو يدعم الربط ، قوالب البيانات ، الاتجاه الأفقي والعمودي ، واختيار العناصر وأكثر من ذلك.

# FeatureWrapPanelDescription
source: Our wrap-panel layout allows displaying wrapped content inside. It arranges its children horizontally inside it, and then wraps the display of subsequent children to additional rows. Supports templates, bindings or XAML content directly.
ar: يسمح تخطيط لوحة التغليف الخاص بنا بعرض محتوى ملفوف بالداخل. يرتب أطفاله أفقيا داخله ، ثم يلف عرض الأطفال اللاحقين إلى صفوف إضافية. يدعم القوالب أو الارتباطات أو محتوى XAML مباشرة.

# FeatureGridViewDescription
source: A bindable and dynamic UI control that inherits from Grid. It allows to easily control how column and rows rendered from a bound data source.
ar: تحكم واجهة المستخدم الديناميكي والديناميكي الذي يرث من الشبكة. يسمح بسهولة التحكم في كيفية تقديم العمود والصفوف من البيانات المرتبطة.

# FeatureIconsDescription
source: Grial 3 provides 8 fonts containing more than free 5K icons available from XAML! Icons are provided in different styles: filled, line, matching look and feel for material design and iOS. They will render sharply across different devices with different pixel densities and resolutions, making this a very flexible and maintainable way that avoids generating lots of bitmaps.
ar: يوفر Grial 3 8 خطوط تحتوي على أكثر من 5K من الرموز المجانية المتاحة لواجهة المستخدم التطبيق الخاص بك! يتم توفير الرموز في أنماط مختلفة: مملوءة ، خط ، مظهر مطابق ومظهر من التصميم متعدد الأبعاد ونظام iOS.يتم استخدامها عبر الصفحات والقوالب ، وسوف يتم عرضها بشكل حاد عبر أجهزة مختلفة بكثافات وحلول بكسل مختلفة ، مما يجعل هذه الطريقة مرنة جدًا وقابلة للصيانة وتتجنب توليد الكثير من الصور النقطية.

# FeatureGrialFlowsDescription
source: Our newest addition to the kit: the flows can be seen as micro apps that cover typical patterns and UX. They contain a certain number of related screens, templates and UI controls, that work together in harmony as a unit. Messages, movie catalog, tasks dashboard and e-commerce flows are available.
ar: أحدث إضافة إلى المجموعة: يمكن رؤية التدفقات كتطبيقات صغيرة تغطي الأنماط النموذجية و UX. تحتوي على عدد معين من الشاشات والقوالب وعناصر تحكم واجهة المستخدم ذات الصلة ، والتي تساعد على تحقيق أهداف محددة تعمل معًا كوحدة واحدة. تتوفر الرسائل والأفلام والمهام وتدفقات التجارة الإلكترونية.

# FeatureSafeAreaEffectTitle
source: iOS Safe Area Effects
ar: Safe Area Effect

# FeatureSafeAreaEffectDescription
source: Our Xamarin Forms effects provide fine-grained control to adjust your page content to the device safe area insets making sure it's never clipped by the rounded corners or the home indicator. The background elements can cover every pixel of the screen and through optional paddings you avoid actual content clipping.
ar: يساعد دعم Xamarin Forms للمنطقة الآمنة لـ iOS على التأكد من عدم قص المحتوى من زوايا الجهاز المستدير أو مؤشر المنزل أو غلاف المستشعر. في بعض الأحيان لا يكفي ذلك ، وتحتاج إلى الذهاب إلى ما هو أبعد والتحكم بشكل أفضل في كيفية عرض الأشياء على شاشات iOS كبيرة. هذا هو السبب في أننا قدمنا هذا التأثير في Grial 3.

# FeatureCustomRenderersDescription
source: Have more control over common Xamarin Forms controls to make them look exactly as you need them. We added more styling properties to controls such as editor, entry, pickers, searchbar and more.
ar: احصل على مزيد من التحكم في عناصر تحكم Xamarin Forms الشائعة لجعلها تبدو كما تحتاج إليها تمامًا. أضفنا المزيد من خصائص التصميم إلى عناصر التحكم ، مثل المحرر ، أو الإدخال ، أو الملتقطون ، أو شريط البحث ، أو عرض الجدول ، وما إلى ذلك.

# FeatureResponsiveHelpersDescription
source: Have full control over how your UI renders across multiple devices, platforms and screen orientations. Control how your page’s content flow. Set your font sizes, alignments, margins, paddings and almost every possible property for each specific case.
ar: تمتع بالتحكم الكامل في كيفية عرض واجهة المستخدم عبر العديد من الأجهزة والأنظمة الأساسية وتوجيهات الشاشة. التحكم في كيفية تدفق محتوى صفحتك. تعيين أحجام الخط الخاص بك ، والمحاذاة ، والهوامش ، paddings وتقريبا كل الممتلكات الممكنة لكل حالة محددة.

# FeatureChartsDescription
source: Add data visualization to your app through our beautifully styled charts. Easily change colors and bind your data through our helpers and wrappers from XAML code.
ar: إضافة تصور البيانات إلى تطبيقك من خلال مخططاتنا الرائعة. يمكنك تغيير الألوان والإعدادات بسهولة من خلال المساعدين والمغلفين وجعل بياناتك تبدو رائعة.

# FeatureAnimationLoopsTitle
source: Animation Loop Behaviors
ar: الرسوم المتحركة حلقة السلوك

# FeatureAnimationLoopsDescription
source: Make your still imagery come to life by adding our Ken Burns behavior. Easily get this panning and zooming effect in your images, icons or any view in your app through this behavior. Use our Pulse behavior to highlight important pieces of UI so your users don't miss anything.
ar: اجعل صورك الثابتة تظهر في حياتك بإضافة سلوك كين بيرنز. يمكنك الحصول بسهولة على هذا التحريك وتأثير التكبير / التصغير في الصور أو الرموز أو أي ملف شخصي في تطبيقك من خلال هذا السلوك.

# FeaturePoweredBy
source: Powered by
ar: مدعوم من

# GrialAboutDescription
source: Designed for .NET Developers. this provides a complete ready made collection of fully customizable layouts, components, templates and resources to help developers and companies build beautiful cross-platform mobile app using Xamarin.Forms.
ar: مصممة لمطوري .NET. يوفر جموعة جاهزة كاملة من التخطيطات والمكونات والقوالب والموارد القابلة للتخصيص بالكامل لمساعدة المطورين والشركات على إنشاء تطبيقات جوّال عبر منصة جميلة باستخدام Xamarin.Forms.

# GrialAboutMission
source: We are a team designers and developers on a mission: taking Xamarin.Forms apps to the next level while having fun, becoming better, healthy, happier people in the process.
ar: نحن أحد مصممي ومصممي الفريق في مهمة: اتخاذ Xamarin.Forms التطبيقات إلى المستوى التالي في حين يلهون ، أن يصبحوا أكثر صحة ، وسعادة الناس في هذه العملية.

# GrialAboutTeam
source: Our team is also well known for our XAML Previsualization tool, Gorilla Player.
ar: فريقنا معروف أيضًا بأداة XAML Previsizationization الخاصة بنا ، Gorilla Player.

# GrialAboutFollowUs
source: Follow us on:
ar: اتبعنا:

# GrialAboutEagerToHear
source: We are eager to hear about your experiences working with Xamarin. Don’t be shy and say hello!
ar: نحن حريصون على سماع خبراتك في العمل مع Xamarin. لا تخجل وتقول مرحبا!

# GrialAboutSayHello
source: Say Hello
ar: قل مرحبا

# GrialAboutTestimonialMiguelDeIcaza
source: I am blown away by how good looking and easy to use GrialKit is. Do yourself a favor and check it out.
ar: أنا في مهب كيف جيدة المظهر وسهلة الاستخدام هي GrialKit. اعمل في نفسك معروف وتأكد منه.

# GrialAboutTestimonialDavidOrtinau
source: GrialKit 3.0 not only gives you gorgeous animations, styling, and tons of layouts, but it teaches you amazing techniques for delivering next level mobile experiences.
ar: أنا في مهب كيف جيدة المظهر وسهلة الاستخدام هلا يمنحك GrialKit 3.0 الرسوم المتحركة الرائعة والتصميم والأطنان من التخطيطات فحسب ، بل إنه يعلمك تقنيات مذهلة لتقديم تجارب الهاتف المحمول من المستوى التالي.

# WhatsNewDescription1
source: More than 160 XAML pages and templates. An infinite set of possibilities to build beautiful apps.
ar: أكثر من 160 صفحة وقوالب XAML. مجموعة لا حصر لها من الاحتمالات لبناء تطبيقات جميلة.

# WhatsNewDescription2
source: Themeable, scalable, Grial Icons provide a huge collection of icons and styles.
ar: تقدم Grial Icons مجموعة ضخمة من الرموز والأنماط.

# WhatsNewDescription3
source: Fluid animations, gradient support, flexible layouts, and much more.
ar: صور متحركة سلسة ودعم تدرجات الألوان وتخطيطات مرنة وغير ذلك الكثير.

# WhatsNewDescription4
source: Tab Control, Data grid, Checkbox, Radio Button, Video Player, Repeater and more.
ar: Tab Control, Data grid, Checkbox, Radio Button, Video Player, Repeater وأكثر من ذلك.

# WhatsNewDescription5
source: Include screens in your project and build your own theme through Grial Web Admin.
ar: قم بتضمين الشاشات في مشروعك وابن موضوعك الخاص من خلال Grial Web Admin.

# WhatsNewTitle2
source: More than 5000 Icons
ar: أكثر من 5000 Icons

# WhatsNewTitle3
source: Richer content
ar: محتوى أكثر ثراء

# WhatsNewTitle4
source: 12 New Controls
ar: 12 ضوابط جديدة

# StringPickYourTheme
source: Pick your theme
ar: اختر مظهرك

# LightThemeDescription
source: Make your eyes cry of happiness!
ar: اجعل عينيك تبكي من السعادة!

# DarkThemeDescription
source: Professional look for your screens.
ar: مظهر احترافي لشاشاتك.

# BlackboardThemeDescription
source: Get a clean view of Grial layouts.
ar: الحصول على عرض نظيف لتنسيقات Grial.

# BlackSunThemeDescription
source: A chill vibe for your app.
ar: جو رائع في تطبيقك.

# HazeThemeDescription
source: Natural look of Grial layouts.
ar: مظهر طبيعي من تخطيطات Grial.

# CabernetLightThemeDescription
source: The delicate choice for your app.
ar: الخيار الدقيق لتطبيقك.
