Repository: thebatinarkham/xam-ui
Catalog: Grial UI Kit for Xamarin Forms 3 Full/AppName/ViewModels/DemoApp/Resx/DemoAppResources.*.resx
Languages: ar

# PageTitleThemesPreview
source: Pick Your Theme
ar: اختر مظهرك

# StringApply
source: Apply
ar: تطبيق

# ScreenCount
source: Screens {0}
ar: {0} شاشات

# MainMenuWhatsNew
source: What's new?
ar: ما هو الجديد؟

# MainMenuControlsAndFeatures
source: Controls and features
ar: عناصر التحكم والميزات

# MainMenuAbout
source: About Binaria
ar: حول

# MainMenuDashboard
source: Main dashboard
ar: لوحة القيادة الرئيسية

# MainMenuIcons
source: All icons
ar: كل الرموز

# MainMenuGrialThemes
source: Grial themes
ar: مواضيع

# StringGetGrial
source: Get Binaria
ar: احصل على

# StringGetGrialNow
source: Get Binaria Wallet now
ar: احصل عل الآن

# ButtonBrowseOurSamples
source: Browse samples
ar: استعرض العينات

# ButtonSeeOurWalkThrough
source: See what's new
ar: ترى ما هو الجديد

# FlowDescriptionMovies
source: Experience the power of animations, and visual effects in this super polished example of movies navigation.
ar: تجربة قوة الرسوم المتحركة ، والتأثيرات المرئية في هذا المثال المصقول للغاية من أفلام الملاحة.

# FlowDescriptionMessages
source: Handle the messages and notifications of your mobile app in a beautiful and simple way. Save time with message flow.
ar: تعامل مع الرسائل والإشعارات من تطبيقك المحمول بطريقة جميلة وبسيطة.

# FlowDescriptionTasks
source: Tasks performance overview dashboard. Team performance overview and team member details.
ar: لوحة المهام نظرة عامة على الأداء. نظرة عامة على أداء الفريق وتفاصيل أعضاء الفريق.

# FlowDescriptionEcommerce
source: A beautiful and simple ecommerce flow, featuring product detail, order confirmation, product checkout and purchase notification.
ar: تدفق التجارة الإلكترونية جميلة وبسيطة.

# DocumentTimelinePageDescription
source: This timeline was designed to show actions over a document. Use it to show a clear sequence of actions performed over any item, i.e a transaction.
ar: تم تصميم هذا المخطط الزمني لعرض الإجراءات على مستند. استخدمها لإظهار تأمين واضح للإجراءات التي يتم تنفيذها على أي عنصر ، بمعنى أي معاملة.

# TimelinePageDescription
source: This timeline is designed to give a clear messaging or conversation overview. Team player collaboration is always a good thing.
ar: تم تصميم هذا المخطط الزمني لإعطاء نظرة واضحة على الرسائل أو المحادثة. تعاون لاعب الفريق هو دائما شيء جيد.

# ProfilePageTimelinePageDescription
source: Use this user profile page to display a bio and some key stats of a person, product or service. Use large pictures to take the best out of this view.
ar: استخدم صفحة ملف تعريف المستخدم هذه لعرض السيرة الذاتية وبعض الإحصائيات الرئيسية لشخص أو منتج أو خدمة. استخدم صورًا كبيرة للاستفادة إلى أقصى حد من هذا العرض.

# SocialPageDescription
source: A classic among modern mobile apps. The social page layout has an overview, some key stats, a photo album, and a cool look and feel.
ar: كلاسيكية بين تطبيقات الجوال الحديثة. يحتوي تخطيط الصفحة الاجتماعية على نظرة عامة ، وبعض الإحصائيات الرئيسية ، وألبوم الصور ، والشكل والمظهر اللطيف.

# SocialVariantPageDescription
source: A classic among modern mobile apps. The social page layout has an overview, some key stats, a photo album, and a cool look and feel.
ar: كلاسيكية بين تطبيقات الجوال الحديثة. يحتوي تخطيط الصفحة الاجتماعية على نظرة عامة ، وبعض الإحصائيات الرئيسية ، وألبوم الصور ، والشكل والمظهر اللطيف.

# SocialCardPageDescription
source: A classic among modern mobile apps but with a design twist. The social card page layout has a bio overview some key stats, connected friends, a photo album. Something simple and nice to delight your users.
ar: الكلاسيكية بين تطبيقات الجوال الحديثة ولكن مع تطور التصميم. يحتوي تخطيط صفحة البطاقات الاجتماعية على نظرة عامة حول بعض الإحصاءات الأساسية ، والأصدقاء المتصلين ، وألبوم الصور. شيء بسيط وجميل لإمتاع المستخدمين لديك.

# FullHeaderArticlePagePageDescription
source: This page combines different ways to perfectly display any kind of content in a beautiful and balanced UI with an eye-catching parallax effect.
ar: تجمع هذه الصفحة بين طرق مختلفة لعرض أي نوع من المحتوى في واجهة مستخدم جميلة ومتوازنة مع تأثير مثير للإعجاب.

# ArticlesClassicViewPageDescription
source: Use this page to display either articles or documentation. It's a commonly used pattern to display an overview of items.
ar: استخدم هذه الصفحة لعرض المقالات أو الوثائق. وهو نمط شائع الاستخدام لعرض نظرة عامة على العناصر.

# ArticlesColumnPageDescription
source: Use this page to display either articles or documentation. This particular view displays a featured article at the top of the page, and in landscape changes layout to show more columns.
ar: استخدم هذه الصفحة لعرض المقالات أو الوثائق. يعرض هذا العرض المحدد مقالة مميزة أعلى الصفحة ، وفي تخطيط التغييرات للمناظر الطبيعية لعرض المزيد من الأعمدة.

# ArticleDetailPageDescription
source: This a classic article view, it displays a featured image and a toolbar with key stats. It's a simple but useful layout.
ar: هذا عرض المقالة الكلاسيكية ، فإنه يعرض صورة مميزة وشريط الأدوات مع الإحصائيات الرئيسية. إنه تخطيط بسيط ولكنه مفيد.

# ArticlesListPageDescription
source: This variation of article list can also be used to show any kind of product, service, or recipe photo. You can also remove the pictures and use a solid color background.
ar: يمكن أيضًا استخدام هذا الاختلاف في قائمة المقالات لعرض أي نوع من أنواع المنتجات أو الخدمات أو وصفة الصور. يمكنك أيضًا إزالة الصور واستخدام خلفية بلون خالص.

# ArticlesFeedPageDescription
source: This variation of the articles view is based on a Twitter-like feed. Each card has an author, featured image, title, and date.
ar: يستند هذا الاختلاف في طريقة عرض المقالات إلى خلاصة تشبه Twitter. تحتوي كل بطاقة على مؤلف ، صورة مميزة ، عنوان وتاريخ.

# DashboardCarouselPageDescription
source: A beautiful dashboard with a carousel view on top. Use it to display categories and eye catching content.
ar: لوحة تحكم جميلة مع عرض دائري في الأعلى. استخدمه لعرض الفئات ومحتوى لفتت الانظار.

# NavigationCardsDescriptionListPageDescription
source: A detailed navigation list showing title, description and tags. Use it to display details about inner content.
ar: قائمة التنقل مفصلة تظهر العنوان والوصف والعلامات. استخدمه لعرض تفاصيل حول المحتوى الداخلي.

# MoviesMainPageDescription
source: Inspired by Netflix and Spotify, this page displays a featured item and multiple horizontal scrollable lists of movies. Use it to display a large amount of items previews such books, documents, movies or audio files.
ar: مستوحاة من Netflix و Spotify ، تعرض هذه الصفحة عنصرًا مميزًا وقوائم متعددة للأفلام قابلة للتمرير الأفقي. استخدمه لعرض عدد كبير من معاينات العناصر مثل الكتب أو المستندات أو الأفلام أو الملفات الصوتية.

# MovieDetailPageDescription
source: This item detail page displays a featured item and related information such as description, rating and related items. Use it to display any kind of product, document or service.
ar: تعرض صفحة تفاصيل المادة عنصرًا مميزًا ومعلومات ذات صلة مثل الوصف والتصنيف والعناصر ذات الصلة. استخدمه لعرض أي نوع من المنتجات أو المستندات أو الخدمات.

# DashboardCardsPageDescription
source: Use this page to display any kind of article, service, document or product. Every item on the grid has an author, a brief description and featured image.
ar: استخدم هذه الصفحة لعرض أي نوع من المقالات أو الخدمات أو المستندات أو المنتجات. كل عنصر على الشبكة لديه مؤلف ، وصف مختصر وصورة مميزة.

# DashboardMultipleTilesPageDescription
source: Use this a beautiful navigation grid with icons, images, and data. Use this page to display different tiles to navigate to apps, locations or just to show messages previews.
ar: استخدم شبكة ملاحة جميلة تحتوي على رموز وصور وبيانات. استخدم هذه الصفحة لعرض تجانبات مختلفة للانتقال إلى التطبيقات أو المواقع أو لعرض معاينات الرسائل فقط.

# IconsDashboardPageDescription
source: This a classic navigation grid with icons. Use is it as the main screen of your app. Useful to show users an easy way to navigate through your app.
ar: هذه شبكة الملاحة الكلاسيكية مع الرموز. الاستخدام هو بمثابة الشاشة الرئيسية لتطبيقك. من المفيد أن تظهر للمستخدمين طريقة سهلة للتنقل عبر تطبيقك.

# FlatDashboardPageDescription
source: This a classic navigation grid with icons. Use is it as the main screen of your app. Useful to show users an easy way to navigate through your app.
ar: هذه شبكة الملاحة الكلاسيكية مع الرموز. الاستخدام هو بمثابة الشاشة الرئيسية لتطبيقك. من المفيد أن تظهر للمستخدمين طريقة سهلة للتنقل عبر تطبيقك.

# ImagesDashboardPageDescription
source: This a classic navigation grid with background images and icons. Use is it as the main screen of your app. Useful to show users an easy way to navigate through your app.
ar: هذه شبكة ملاحة كلاسيكية مع صور خلفية ورموز. الاستخدام هو بمثابة الشاشة الرئيسية لتطبيقك. من المفيد أن تظهر للمستخدمين طريقة سهلة للتنقل عبر تطبيقك.

# NavigationCardsListPageDescription
source: A good looking card list menu is always effective to show different categories of items. For example, different store departments or different document categories.
ar: دائمًا ما تكون قائمة قائمة البطاقات الجيدة فعالة لعرض فئات مختلفة من العناصر. على سبيل المثال ، أقسام المتجر المختلفة أو فئات الوثيقة المختلفة.

# EmptyStatePageDescription
source: This a simple but useful view. Use it to notify your users when something went wrong or something has changed.
ar: هذه وجهة نظر بسيطة ولكنها مفيدة. استخدمها لإعلام المستخدمين عندما حدث خطأ ما أو تم تغيير شيء ما.

# NotificationsPageDescription
source: Notifications page it's always useful in any app. Updates, policy changes, password updates, etc.
ar: صفحة الإشعارات مفيدة دائمًا في أي تطبيق. التحديثات والتغييرات في السياسة وتحديثات كلمات المرور وغير ذلك

# NavigationFlatListPageDescription
source: A good looking list menu is always effective to show different categories of items. For example, different store departments or different document categories.
ar: دائمًا ما تكون قائمة القائمة الجيدة فعالة لإظهار فئات مختلفة من العناصر. على سبيل المثال ، أقسام المتجر المختلفة أو فئات الوثيقة المختلفة.

# NavigationListWithImagesPageDescription
source: A good looking list menu is always effective to show different categories of items. For example, different store departments or different document categories.
ar: دائمًا ما تكون قائمة القائمة الجيدة فعالة لإظهار فئات مختلفة من العناصر. على سبيل المثال ، أقسام المتجر المختلفة أو فئات الوثيقة المختلفة.

# NavigationListWithIconsPageDescription
source: This example shows a simple list menu with icons, titles and a number preview. Use it to show different categories of products, services or documents.
ar: يوضح هذا المثال قائمة قائمة بسيطة تحتوي على رموز وعناوين ومعاينة رقم. استخدمها لإظهار فئات مختلفة من المنتجات أو الخدمات أو المستندات.

# TabbedLoginPageDescription
source: A perfect combination of simplicity and functionality. This tabbed page is another great option to include in your app.
ar: مزيج مثالي من البساطة والوظائف. هذه الصفحة المبوبة هي خيار رائع آخر لتضمينه في تطبيقك.

# SimpleSignUpPageDescription
source: A simple Sign Up page to register new users into your app. Add or remove controls and content as you need.
ar: صفحة تسجيل بسيطة لتسجيل مستخدمين جدد في تطبيقك. إضافة أو إزالة عناصر التحكم والمحتوى حسب احتياجك.

# SimpleLoginPageDescription
source: This Login Page is both useful and simple. Add or remove controls and content as you need.
ar: صفحة تسجيل الدخول هذه مفيدة وبسيطة. إضافة أو إزالة عناصر التحكم والمحتوى حسب احتياجك.

# LoginPageDescription
source: This Login Page is both useful and simple. Add or remove controls and content as you need.
ar: صفحة تسجيل الدخول هذه مفيدة وبسيطة. إضافة أو إزالة عناصر التحكم والمحتوى حسب احتياجك.

# SignUpPageDescription
source: A simple Sign Up page to register new users into your app. Add or remove controls and content as you need.
ar: صفحة تسجيل بسيطة لتسجيل مستخدمين جدد في تطبيقك. إضافة أو إزالة عناصر التحكم والمحتوى حسب احتياجك.

# PasswordRecoveryPageDescription
source: This is a simple password recovery page. Add or remove controls and content as you need.
ar: هذه صفحة بسيطة لاستعادة كلمة المرور. إضافة أو إزالة عناصر التحكم والمحتوى حسب احتياجك.

# ProductImageFullScreenPageDescription
source: Very useful to show product pictures and short descriptions. Use it to show product details.
ar: من المفيد جدا لعرض صور المنتجات والأوصاف القصيرة. استخدمه لإظهار تفاصيل المنتج.

# ProductsCatalogPageDescription
source: A common UI to showcase products or collections. Use it to display either product or services.
ar: واجهة مستخدم شائعة لعرض المنتجات أو المجموعات. استخدمه لعرض المنتج أو الخدمات.

# ProductOrderPageDescription
source: This a useful page if you are planning to sell other products or services through the app.
ar: هذه صفحة مفيدة إذا كنت تخطط لبيع منتجات أو خدمات أخرى من خلال التطبيق.

# ProductsGridPageDescription
source: This a useful page if you are planning to sell other products or services through the app.
ar: هذه صفحة مفيدة إذا كنت تخطط لبيع منتجات أو خدمات أخرى من خلال التطبيق.

# ProductsGridVariantPageDescription
source: This page is inspired by a common products showcase pattern. Use to showcase either products or services in your app.
ar: هذه الصفحة مستوحاة من نمط عرض المنتجات الشائعة. استخدم لعرض منتجات أو خدمات في تطبيقك.

# ProductItemViewPageDescription
source: A simple but useful way to show content. In this example, we choose to show a product. Featured image, title, price, and description.
ar: طريقة بسيطة ولكنها مفيدة لإظهار المحتوى. في هذا المثال ، نختار عرض منتج. صورة مميزة والعنوان والسعر والوصف.

# ProductsCarouselPageDescription
source: A simple but useful way to show content. In this example, we choose to show a product. Browse more related products swiping.
ar: طريقة بسيطة ولكنها مفيدة لإظهار المحتوى. في هذا المثال ، نختار عرض منتج. تصفح المزيد من المنتجات ذات الصلة الضرب.

# WalkthroughPageDescription
source: This Walkthrough is designed to be functional almost in every app. Use it to give users a quick tour through your app.
ar: تم تصميم هذا التجوّل ليعمل تقريبًا في كل تطبيق. استخدمه لمنح المستخدمين جولة سريعة عبر تطبيقك.

# WalkthroughFlatPageDescription
source: This Walkthrough is designed to be functional almost in every app. Use it to give users a quick tour through your app.
ar: تم تصميم هذا التجوّل ليعمل تقريبًا في كل تطبيق. استخدمه لمنح المستخدمين جولة سريعة عبر تطبيقك.

# WalkthroughVariantPageDescription
source: This Walkthrough is designed to be functional almost in every app. Use it to give users a quick tour through your app.
ar: تم تصميم هذا التجوّل ليعمل تقريبًا في كل تطبيق. استخدمه لمنح المستخدمين جولة سريعة عبر تطبيقك.

# ChatTimelinePageDescription
source: This Chat Timeline page is desgined to show a conversation or interaction. Use it to display interactions or workflows.
ar: تم تصميم صفحة "جدول زمني للدردشة" لعرض محادثة أو تفاعل. استخدمه لعرض التفاعلات أو سير العمل.

# RecentChatListPageDescription
source: Inspired by commonly used chat applications, this is a list of conversations. Each list item shows a contact and its last message.
ar: مستوحاة من تطبيقات الدردشة المستخدمة عادة ، هذه قائمة من المحادثات. يعرض كل عنصر قائمة جهة اتصال ورسالته الأخيرة.

# MessagesListPageDescription
source: Inspired by commonly used chat applications, this is a list of conversations. Each list item shows a contact and its last message.
ar: مستوحاة من تطبيقات الدردشة المستخدمة عادة ، هذه قائمة من المحادثات. يعرض كل عنصر قائمة جهة اتصال ورسالته الأخيرة.

# ChatMessagesListPageDescription
source: Inspired by most commonly used chat applications like Skype, Telegram, Whatsapp, Slack, and so many others.
ar: مستوحاة من تطبيقات الدردشة الأكثر استخدامًا مثل Skype و Telegram و Whatsapp و Slack وغير ذلك الكثير.

# TabControlCustomSamplePageDescription
source: Grial Tab Control is fully customizable. Place it anywhere on the screen and get a consistent look and feel across platforms.
ar: Grial Tab Control قابلة للتخصيص بالكامل. ضعه في أي مكان على الشاشة واحصل على مظهر وملمس متناسقين عبر الأنظمة الأساسية.

# TabControlAndroidSamplePageDescription
source: Get Android TabControl look and feel also in your iOS application.
ar: احصل على مظهر وشاشة Android TabControl أيضًا في تطبيق iOS الخاص بك.

# TabControliOSSamplePageDescription
source: Get iOS TabControl look and feel also in your Android application.
ar: احصل على مظهر وشاشة iOS TabControl أيضًا في تطبيق Android.

# TabControlBottomPlacementSamplePageDescription
source: Get a fully customizable Android bottom Tab Control for your app.
ar: احصل على عنصر تحكم تبويب أسفل Android قابل للتخصيص بالكامل لتطبيقك.

# TabPageDescription
source: A simple Tabbed Page sample page.
ar: صفحة نموذج صفحة مبوبة بسيطة.

# DemoSettingsPageDescription
source: Displays a list with all our gorgeous themes where you can choose any of them.
ar: يعرض قائمة بكل موضوعاتنا الرائعة حيث يمكنك اختيار أي منها.

# GenericAboutPageDescription
source: Use this template to display general info about your mobile application.
ar: استخدم هذا القالب لعرض معلومات عامة حول تطبيق هاتفك المحمول.

# RichAboutPageDescription
source: An eye catching about page with nice parallax and scroll animations. Use this template to display general info about your mobile application.
ar: لفتت للنظر عن الصفحة مع المنظر لطيفة والرسوم المتحركة التمرير. استخدم هذا القالب لعرض معلومات عامة حول تطبيق هاتفك المحمول.

# CustomSettingsPageDescription
source: A simple settings page. Use this page as a basic settings display page.
ar: صفحة إعدادات بسيطة. استخدم هذه الصفحة كصفحة عرض إعدادات أساسية.

# CustomActivityIndicatorPageDescription
source: This is a simple custom Activity Indicator. Change the content as you wish.
ar: هذا هو مؤشر نشاط مخصص بسيط. تغيير المحتوى كما يحلو لك.

# ResponsiveHelpersPageDescription
source: The Responsive Helpers will allow you to take full control of how things layout on your pages, different devices, orientations, and platforms.
ar: سيسمح لك المستخدمون المتجاوبون بالتحكم الكامل في كيفية تخطيط الأشياء على صفحاتك ، والأجهزة المختلفة ، والاتجاهات ، والأنظمة الأساسية.

# IconsPageDescription
source: Use this page to overview all available icons in Grial.
ar: استخدم هذه الصفحة لإلقاء نظرة عامة على جميع الرموز المتاحة في Grial.

# ThemeOverviewPageDescription
source: A simple page showing all xamarin forms controls styled with current Grial selected theme.
ar: صفحة بسيطة تظهر جميع عناصر التحكم في نماذج xamarin التي تم تصميمها بمظهر Grial المحدد الحالي.

# CustomRenderersPageDescription
source: A simple page that lists all available Grial custom renderers.
ar: صفحة بسيطة تسرد جميع العارضين المخصصين من Grial.

# SettingsPageDescription
source: A simple settings page. Use this page as a basic settings display page.
ar: صفحة إعدادات بسيطة. استخدم هذه الصفحة كصفحة عرض إعدادات أساسية.

# PerformanceDashboardMainPageDescription
source: Get a quick overview of team tasks. This great example showcases a lot of cool stuff, including our Data Grid control.
ar: احصل على نظرة عامة سريعة على مهام الفريق. يعرض هذا المثال الرائع الكثير من الأشياء الرائعة ، بما في ذلك التحكم في شبكة البيانات.

# EmployeePerformanceDashboardPageDescription
source: A clean example useful to show Employee Performance details. Add, remove and customize it according to your specific needs.
ar: مثال نظيف مفيد لإظهار تفاصيل أداء الموظف. يمكنك إضافة وإزالة وتخصيصها وفقًا لاحتياجاتك الخاصة.

# EmployeeProfileDashboardPageDescription
source: A clean example useful to show Employee Performance details. Add, remove and customize it according to your specific needs.
ar: مثال نظيف مفيد لإظهار تفاصيل أداء الموظف. يمكنك إضافة وإزالة وتخصيصها وفقًا لاحتياجاتك الخاصة.

# AddContactPageDescription
source: Add a new contact to your app, organization or team. This form has been designed to simplify a commonly used page in mobile apps.
ar: أضف جهة اتصال جديدة إلى تطبيقك أو مؤسستك أو فريقك. تم تصميم هذا النموذج لتبسيط صفحة شائعة الاستخدام في تطبيقات الجوال.

# ContactSimpleDetailPageDescription
source: This is a simple but beautiful designed contact details page. It can be also used as a profile page.
ar: هذه صفحة تفاصيل اتصال بسيطة ولكنها جميلة مصممة. يمكن استخدامه أيضًا كصفحة ملف شخصي.

# ContactDetailPageDescription
source: This is a simple but beautiful designed contact details page. It can be also used as a profile page.
ar: هذه صفحة تفاصيل اتصال بسيطة ولكنها جميلة مصممة. يمكن استخدامه أيضًا كصفحة ملف شخصي.

# ChatMessagesPageDescription
source: The kind of template that will save you countless hours of design and implementation.
ar: نوع القالب الذي سيوفر لك ساعات لا تحصى من التصميم والتنفيذ.

# ChatMainPageDescription
source: A clean but effective design. Showcasing Grial Custom Tab control. This is a great example of a simple UI design.
ar: تصميم نظيف وفعال. عرض التحكم في علامة التبويب Grial المخصصة. هذا مثال رائع لتصميم واجهة المستخدم البسيطة.

# CardArticlePageDescription
source: Perfect to display any kind of content the Card Article page template display a modern look and feel. Perfect to show food recipes.
ar: مثالي لعرض أي نوع من المحتوى ، يعرض قالب صفحة مقالة البطاقة مظهرًا وأسلوبًا حديثًا. مثالية لإظهار وصفات الطعام.

# ArticlesBrowserPageDescription
source: A beautiful way to display content. Perfect to be used as the main navigation for travels and tourism related content.
ar: طريقة جميلة لعرض المحتوى. مثالية للاستخدام كملاحة رئيسية للسفريات والمحتوى المتعلق بالسياحة.

# FeaturedMoviesPageDescription
source: Delight your users with this beautifully designed content navigation. Use it to display any kind of product or services inside your app.
ar: استمتع بمستخدمي هذا التنقل للمحتوى المصمم بشكل جميل. استخدمها لعرض أي نوع من المنتجات أو الخدمات داخل تطبيقك.

# CurvedHeaderArticlePageDescription
source: This Blog Article page was designed to showcase tours, trips or similar kind of experiences.
ar: تم تصميم صفحة مقالة المدونة هذه لعرض جولات أو رحلات أو أي نوع مماثل من التجارب.

# OrganizationFormPageDescription
source: A nice and clean form page to add organization data.
ar: صفحة نموذج جميلة ونظيفة تعرض بيانات المستخدم.

# FullBackgroundLoginPageDescription
source: Stylish and simple Login Page. Add some branding with a simple image in the background.
ar: صفحة تسجيل دخول أنيقة وبسيطة. أضف بعض العلامات التجارية باستخدام صورة بسيطة في الخلفية.

# FullBackgroundSignupPageDescription
source: If you are building an app that handles multiple providers this form will be a very useful one to have.
ar: إذا كنت بصدد إنشاء تطبيق يتعامل مع موفرين متعددين ، فسيكون هذا النموذج مفيدًا جدًا.

# EmployeeFormPageDescription
source: From employees to products, this form layout it's a nice way to add anything in your app.
ar: من الموظفين إلى المنتجات ، تخطيط النموذج هذا ، إنها طريقة لطيفة لإضافة أي شيء في تطبيقك.

# EcommerceMainPageDescription
source: This is a perfect layout to use on any kind of store app. It includes a search field and a top area to display offers or featured products.
ar: هذا تخطيط مثالي لاستخدامه في أي نوع من تطبيقات المتجر. يتضمن حقل بحث ومنطقة أعلى لعرض العروض أو المنتجات المميزة.

# ProductDetailPageDescription
source: This product display page has it all. If you are building an app that showcases products or services, this a must-have page.
ar: هذه الصفحة عرض المنتج لديها كل شيء. إذا كنت بصدد إنشاء تطبيق يعرض منتجات أو خدمات ، فيجب أن تكون هذه الصفحة ضرورية.

# OrderConfirmationPageDescription
source: Useful in any E-commerce app: an order confirmation is always needed.
ar: مفيدة في أي تطبيق للتجارة الإلكترونية: هناك حاجة دائمًا إلى تأكيد الطلب.

# CheckoutPageDescription
source: If you are planning to sell anything through your app, you will probably need this template.
ar: إذا كنت تخطط لبيع أي شيء من خلال تطبيقك ، فستحتاج على الأرجح إلى هذا النموذج.

# VideoCarouselHighlightsPageDescription
source: An eye-catching and interactive page showing a video background with a carousel view that animates and transitions the video colors on swipe over it.
ar: صفحة جذابة وتفاعلية تعرض خلفية للفيديو مع عرض دائري يحفز وينقل ألوان الفيديو على التمرير فوقها.
