Repository: thebatinarkham/xam-ui
Catalog: Grial UI Kit for Xamarin Forms 3 Full/AppName/Resx/AppResources.*.resx
Languages: es_mx

# StringSave
source: Save
es_mx: Guardar

# StringCompare
source: Compare
es_mx: Comparar

# StringShare
source: Share
es_mx: Compartir

# StringBuy
source: Buy
es_mx: Comprar

# StringUsername
source: Username
es_mx: Usuario

# StringName
source: Name
es_mx: Nombre

# StringLastName
source: Last Name
es_mx: Ultimo Nombre

# StringCardNumber
source: Card Number
es_mx: Número de tarjeta

# StringExpirationDate
source: Expiration Date
es_mx: Fecha de expiración

# StringAddress
source: Address
es_mx: Dirección

# StringAddress1
source: Address Line 1
es_mx: Dirección linea 1

# StringAddress2
source: Address Line 2
es_mx: Dirección linea 2

# StringCity
source: City
es_mx: Ciudad

# StringState
source: State
es_mx: Estado

# StringZipCode
source: Zip Code
es_mx: Código Postal

# StringCountry
source: Country
es_mx: Pais

# StringNotes
source: Notes
es_mx: Notas

# StringExplore
source: Explore
es_mx: Explorar

# StringSignUp
source: Sign Up!
es_mx: Registro

# StringLogin
source: Login
es_mx: Inicio de Sesión

# StringWelcomeToGrial
source: Welcome to Binaria!
es_mx: Bienvenido a Binaria

# StringSend
source: Send
es_mx: Enviar

# StringDone
source: Done
es_mx: Hecho

# StringConfirmation
source: Confirmation
es_mx: Confirmación

# StringNotification
source: Notification
es_mx: Notificación

# StringSuccess
source: Success
es_mx: Satisfactorio

# StringWarning
source: Warning
es_mx: Advertencia

# StringScreens
source: screens
es_mx: pantallas

# StringCategorySocial
source: Social
es_mx: Perfil Social

# StringCategoryArticles
source: Articles
es_mx: Articulos

# StringCategoryDashboards
source: Dashboards
es_mx: Tableros

# StringCategoryNavigation
source: Navigation
es_mx: Navegación

# StringCategoryLogins
source: Logins
es_mx: Inicios de sesión

# StringCategoryForms
source: Forms
es_mx: Formularios

# StringCategoryECommerce
source: ECommerce
es_mx: Comercio Electrónico

# StringCategoryWalkthroughs
source: Walkthroughs
es_mx: Tutoriales

# StringCategoryOnboarding
source: Onboarding
es_mx: Incorporaciones

# StringCategoryMessages
source: Messages
es_mx: Mensajes

# StringCategoryTheme
source: Theme
es_mx: Temas

# StringCategoryDataViz
source: Data Viz
es_mx: Tableros de datos

# StringRobertStainford
source: Robert Stainford
es_mx: Roberto Carlos

# StringNext
source: Next
es_mx: Siguiente

# StringPrevious
source: Previous
es_mx: Anterior

# StringFinish
source: Finish!
es_mx: Finalizar

# StringContact
source: Contact
es_mx: Contacto

# StringContactUs
source: Contact Us
es_mx: Contactanos

# StringEditContact
source: Edit contact
es_mx: Editar Contacto

# StringNewContact
source: Add contact
es_mx: Agregar contacto

# StringLoading
source: Loading...
es_mx: Cargando...

# StringSkip
source: Skip
es_mx: Saltar

# StringSaveChanges
source: Save Changes
es_mx: Guardar Cambios

# StringBatmanChoice
source: Batman's choice
es_mx: Selección

# StringExtraSoftUIFlavor
source: Extra soft UI flavor
es_mx: Sabor extra

# StringImpressYourBoss
source: Impress your boss
es_mx: Impresiona a tu jefe

# StringIcons
source: Icons
es_mx: Iconos

# StringContextActionTapped
source: {0} Context Action Tapped
es_mx: {0} tocado

# StringTappedOnContextAction
source: You tapped on {0} context action.
es_mx: toco sobre {0}

# StringMessageTapped
source: Message Tapped
es_mx: Mensaje tocado

# StringButtonTapped
source: Button Tapped
es_mx: Botón tocado

# StringTappedOnAuthorMessage
source: You tapped on {0}'s message.
es_mx: toco sobre {0}

# StringMoreFrom
source: More from {0}
es_mx: Más desde {0}

# StringLastMonth
source: Last Month
es_mx: Ultimo Mes

# StringLastYear
source: Last Year
es_mx: Ultimo Año

# StringLastWeek
source: Last Week
es_mx: Ultima Semana

# StringRelatedNews
source: Related news
es_mx: Noticias relacionadas

# StringAll
source: All
es_mx: Todo

# StringInTransit
source: In Transit
es_mx: En Tránsito

# StringClosed
source: Closed
es_mx: Cerrado

# StringClose
source: Close
es_mx: Cerrar

# StringOpen
source: Open
es_mx: Abierto

# RemainingTasks
source: {0} tasks remaining
es_mx: {0} tareas pendientes

# AgendaTitle
source: Your Agenda for this week
es_mx: Tu agenda para esta semana

source: Completed Tasks
es_mx: Tareas Completadas

# StringWorkspaces
source: Workspaces
es_mx: Espacios de trabajo

# StringProjects
source: Projects
es_mx: Proyectos

# StringDetails
source: Details
es_mx: Detalles

# PageTitleParallaxHeaderArticle
source: Parallax Header Article
es_mx: Articulo con encabezado

# PageTitleCardArticle
source: Card Article
es_mx: Articulo en tarjeta

# PageTitleCurvedHeaderArticle
source: Curved Header Article
es_mx: Articulo con cabecera curva

# PageTitleArticlesClassicView
source: Articles Classic View
es_mx: Vista clásica de articulos

# PageTitleArticlesFeed
source: Articles Feed
es_mx: Feed de articulos

# PageTitleArticlesList
source: Articles List
es_mx: Lista de articulos

# PageTitleArticlesListVariant
source: Articles List Variant
es_mx: Lista variante de articulos

# PageTitleArticlesColumns
source: Articles Columns
es_mx: Columnas de articulos

# PageTitleArticleDetail
source: Article Detail
es_mx: Detalle de articulo

# PageTitleDashboardCards
source: Dashboard Cards
es_mx: Tableros con tarjetas

# PageTitleFlatDashboard
source: Flat Dashboard
es_mx: Tablero plano

# PageTitleDashboardMultipleTiles
source: Multiple Tiles
es_mx: Multiples fichas

# PageTitleIconsDashboard
source: Icons Dashboard
es_mx: Tablero de iconos

# PageTitleImagesDashboard
source: Images Dashboard
es_mx: Tablero de impagenes

# RoundedLabelCast
source: CAST
es_mx: ACTORES

# AlertTitleMovieTapped
source: Movie Tapped!
es_mx: Clic en pelicula

# AlertMessageMovieShouldPlayMovieNow
source: You should start playing the movie now
es_mx: Debes reproducir la pelicula ahora

# SampleDashboardGrialMovies
source: Movies Main Page
es_mx: Página principal de peliculas

# ButtonPlayMovie
source: Play Movie
es_mx: Reproducir Pelicula

# PageTitleChatMain
source: Chat Main Page
es_mx: Página de Chat

# PageTitleChatMessages
source: Chat Messages Flow
es_mx: Flujo de mensajes de char

# PageTitleAddContact
source: Add Contact Page Flow
es_mx: Agregar contacto

# PageTitleContactDetail
source: Contact Detail Page Flow
es_mx: Flujo detalle de página de contacto

# PageTitleContactSimpleDetail
source: Contact Simple Detail
es_mx: Detalle simple de contacto

# PageTitleDocumentTimeline
source: Document Timeline
es_mx: Cronograma del documento

# PageTitleProfile
source: Profile
es_mx: Perfil

# SampleUserProfile
source: User Profile
es_mx: Perfil de usuario

# PageTitleSocialVariant
source: Social Variant
es_mx: Variante social

# PageTitleSocialCard
source: Social Card
es_mx: Tarjeta social

# PageTitleTimeline
source: Timeline
es_mx: Linea de tiempo

# PageTitleSocialGalleryImagePreview
source: Image Preview
es_mx: Vista previa de imágen

# StringFriends
source: FRIENDS
es_mx: AMIGOS

# StringPhotos
source: PHOTOS
es_mx: FOTOS

# PageTitleCheckout
source: Checkout Page
es_mx: Página de pago

# PageTitleEcommerceMain
source: Ecommerce Flow Main Page
es_mx: Página principal de flujo de comercio electrónico

# PageTitleOrderConfirmation
source: Order Confirmation
es_mx: Confirmación de orden

# PageTitleProductDetail
source: Product Detail
es_mx: Detalle de producto

# ButtonAddToCart
source: Add to cart
es_mx: Agregar a carrito

# PageTitleProductsCatalog
source: Products Catalog
es_mx: Catálogo de productos

# PageTitleProductItemFullScreen
source: Product FullScreen
es_mx: Pantalla completa del producto

# PageTitleProductImageFullScreen
source: Product FullScreen
es_mx: Pantalla completa del producto

# SampleProductFullscreen
source: Product FullScreen
es_mx: Pantalla completa de productos

# PageTitleProductOrder
source: Product Order
es_mx: Orden del producto

# PageTitleProductsGrid
source: Products Grid
es_mx: Lista de productos

# PageTitleProductsGridVariant
source: Products Grid Variant
es_mx: Lista de productos variante

# BannerTitle25DiscOff
source: 25% discount
es_mx: 25% de descuento

# BannerBodyEnjoyItNow
source: Enjoy it now!
es_mx: Disfrutalo ahora

# PageTitleProductItemView
source: Product Item View
es_mx: Vista del elemento del producto

# SampleProductItemView
source: Product Item View
es_mx: Vista por producto

# SampleProductCarousel
source: Products Carousel
es_mx: Carrusel de productos

# PageTitleProductsCarousel
source: Products Carousel
es_mx: Carrusel de productos

# PageTitleTabbedLogin
source: Tabbed Login
es_mx: Inicio de sesión con tab

# PageTitleFullBackgroundLogin
source: Full Background Login
es_mx: Acceso con fondo completo

# PageTitleFullBackgroundSignup
source: Full Background Signup
es_mx: Registro con fondo completo

# PageTitleOrganizationForm
source: Organization Form
es_mx: Formulario organizacional

# PageTitleSimpleLogin
source: Simple Login
es_mx: Inicio de sesión simple

# PageTitleSimpleSignUp
source: Simple Sign Up
es_mx: Registro simple

# PageTitlePasswordRecovery
source: Password Recovery
es_mx: Recuperación de contraseña

# PageTitleLogin
source: Login
es_mx: Inicio de Sesión

# PageTitleSignUp
source: Sign Up
es_mx: Registro

# LabelUseCredentialsToLogin
source: Use your credentials to login.
es_mx: Usa tus credenciales para iniciar sesión

# LabelOrConnectWith
source: Or connect with
es_mx: O conectar con

# LabelForgotYourPassword
source: Forgot your password?
es_mx: Olvidó su contraseña?

# LabelForgotYourPasswordExplained
source: Don't worry type your email here and we will recover it for you.
es_mx: Introduzca su correo y lo recuperaremos por usted

# ErrorPleaseEnterValidEmail
source: Please enter a valid e-mail
es_mx: Introduce un email válido

# LabelLoginOrRegisterUsinMailOrPass
source: Login or register using your email and password.
es_mx: Logeo o registro con email y password

# LabelRegisterNow
source: Register now
es_mx: Registrarse ahora

# LabelRegisterNowAndEnjoy
source: Register now and enjoy the pleasures of the demo.
es_mx: Registrarse ahora y disfrutar de la demo

# LabelPasswordsDoNotMatch
source: Passwords do not match
es_mx: Passwords no coinciden

# LabelRepeatPassword
source: Repeat Password
es_mx: Repetir Password

# ButtonAlreadyUserLoginNow
source: Already a user? Login now
es_mx: Ya eres usuario? Inicia ahora

# PageTitlePopups
source: Popups and Dialogs
es_mx: Popups y flotantes

# PageTitleChatTimeline
source: Chat Timeline
es_mx: Linea de tiempo de chat

# PageTitleRecentChatList
source: Recent Chat List
es_mx: Lista de chat reciente

# PageTitleMessagesList
source: Messages List
es_mx: Lista de mensajes

# PageTitleChatMessagesList
source: Chat Messages List
es_mx: Lista de mensajes de chat

# LabelThereIsNothingHere
source: There's nothing here my friend :)
es_mx: No hay nada aqui mi amigo

# PageTitleNavigationCardsDescriptionList
source: Card Description List
es_mx: Lista de tarjetas con descripción

# PageTitleMoviesMain
source: Grial Movies
es_mx: Peliculas Vip

# PageTitleFeaturedMovies
source: Featured Movies
es_mx: Peliculas destacadas

# PageTitleMovieDetail
source: Movie Detail
es_mx: Detalle de peliculas

# PageTitleArticlesBrowser
source: Articles Browser
es_mx: Explorador de articulos

# PageTitleDashboardCarousel
source: Dashboard with Carousel
es_mx: Tableros con carrusel

# PageTitleMainMenu
source: Main Menu
es_mx: Menú Principal

# PageTitleNavigationCardsList
source: Cards List
es_mx: Lista de tarjetas

# PageTitleNavigationFlatList
source: Flat List
es_mx: Lista plana

# PageTitleNavigationListWithIcons
source: List With Icons
es_mx: Lista con iconos

# PageTitleNavigationListWithImages
source: List With Images
es_mx: Lista con imágenes

# PageTitleEmptyState
source: Empty State
es_mx: Estado vacio

# PageTitleNotifications
source: Notifications
es_mx: Notificaciones

# StringReadyMadeUIsForXamarin
source: Ready made UI's for Xamarin.Forms.
es_mx: UI en Xamarin

# PageTitleWelcome
source: Welcome Page
es_mx: Página de bienvenida

# LabelTakeYourAppToNextLevel
source: Take your Xamarin App to the next level with Grial UI Kit V3.
es_mx: Lleva tu app al siguiente nivel

# LabelWelcomeToGrialStarter
source: Welcome to Grial Starter
es_mx: Bienvenido a Binaria

# LabelWelcomeToGrialStarterDescription
source: You are all setup and ready to rock!
es_mx: Estas listo para iniciar

# TakeWalkThrough
source: Take tour
es_mx: Tomar tour

# PageTitleVideoCarouselHighlights
source: Video Carousel Highlights
es_mx: Carrurel de video

# PageTitleWalkthroughGradient
source: Walkthrough Gradient
es_mx: Tutorial gradiente

# PageTitleWalkthroughIllustration
source: Walkthrough Illustration
es_mx: Tutorial con ilustraciones

# PageTitleWalkthroughImage
source: Walkthrough Image
es_mx: Tutorial con impagenes

# PageTitleWalkthroughMinimal
source: Walkthrough Minimal
es_mx: Tutorial minimalista

# PageTitleWalkthroughFlat
source: Walkthrough Flat
es_mx: Tutorial plano

# PageTitleWalkthrough
source: Walkthrough
es_mx: Tutorial

# PageTitleWalkthroughVariant
source: Walkthrough
es_mx: Tutorial

# SampleTitleWalkthrough
source: Walkthrough
es_mx: Tutoriales

# SampleTitleWalkthroughFlat
source: Walkthrough Flat
es_mx: Tutorial plano

# SampleTitleWalkthroughVariant
source: Walkthrough Variant
es_mx: Variante de tutorial

# WalkthroughHeaderLearn
source: Learn
es_mx: Aprender

# WalkthroughHeaderSaveTime
source: Save Time
es_mx: Guardar Tiempo

# WalkthroughHeaderWelcome
source: Welcome
es_mx: Bienvenido

# WalkthroughTextLearn
source: Learn while you do. Grial has tons of examples for you to play.
es_mx: Muchos ejemplos de pantalla

# WalkthroughTextSaveTime
source: Save countless hours of UI design. Focus on what you do best.
es_mx: Enfocate en el negocio, no el diseño

# WalkthroughTextWelcome
source: To a new world of posibilities, welcome to Binaria.
es_mx: a un mundo nuevo de posibilidades con binaria

# PageTitleThemeOverview
source: Grial Theme Overview Page
es_mx: Página de temas

# StringAnimation
source: Animation
es_mx: Animación

# PageTitleTabControlCustomSample
source: Grial TabControl
es_mx: Control tab

# PageTitleTabControlAndroidSample
source: Grial Android TabControl
es_mx: Control tab de android

# PageTitleTabControliOSSample
source: Grial iOS TabControl
es_mx: Control tab iOS

# PageTitleTabControlBottomPlacementSample
source: Grial Android Bottom TabControl
es_mx: Control tab de android inferior

# PageTitleTab
source: Tabbed Page
es_mx: Página con tab

# SampleTitleThemeDemoSettings
source: Pick Your Theme
es_mx: Temas

# PageTitleAbout
source: Generic About Page
es_mx: Acerca De Genérico

# PageTitleGenericAbout
source: Generic About Page
es_mx: Página acerca de genérica

# PageTitleRichAbout
source: Rich About Page
es_mx: Página acerca de

# PageTitleCustomSettings
source: Custom Settings Page
es_mx: Página de configuraciones

# PageTitleCustomActivityIndicator
source: Custom Activity Indicator
es_mx: Indicador de actividad personalizado

# PageTitleResponsiveHelpers
source: Responsive Helpers
es_mx: Auxiliares responsivos

# PageTitleNativeControls
source: Native Controls
es_mx: Controles nativos

# PageTitleCustomRenderers
source: Custom Renderers
es_mx: Renderizadores personalizados

# PageTitleCommonViews
source: Grial Common Views
es_mx: Vistas comúnes

# PageTitleSettings
source: Settings Page
es_mx: Página de configuración

# LabelDisplayGlobalIssues
source: Display Global issues
es_mx: Mostrar issues

# LabelClearImageCache
source: Clear Image Cache
es_mx: Borrar cache de impagen

# LabelActivityIndicators
source: ActivityIndicators
es_mx: Indicadores

# LabelButtons
source: Buttons
es_mx: Botones

# LabelFrames
source: Frames
es_mx: Recuadros

# LabelThisIsAFrameDescription
source: This is a frame containing a Label control
es_mx: Este es un cuadro con un control de etiqueta

# LabelEntriesAndEditors
source: Entries And Editors
es_mx: Entradas y Editores

# EditorSampleText
source: I'm an Editor and I love multiple lines! ;)
es_mx: Editor de multiples lineas

# LabelProgressBars
source: ProgressBars
es_mx: Barras de Progreso

# PickerTitleSample
source: I'm a Picker!
es_mx: Soy un recolector

# LabelListViewAndSearchBar
source: ListView and SearchBar
es_mx: Listas y Busquedas

# SearchBarPlaceholderSearchForAName
source: Search for a name
es_mx: Buscar por nombre

# ButtonDefault
source: Default
es_mx: Predeterminado

# ButtonPrimaryAction
source: Primary Action
es_mx: Acción Primaria

# ButtonSecondaryAction
source: Secondary Action
es_mx: Acción Secundara

# ButtonSave
source: Save
es_mx: Guardar

# ButtonDelete
source: Delete
es_mx: Eliminar

# ButtonMore
source: More
es_mx: Mas

# ButtonAddComment
source: Add Comment
es_mx: Agregar comentario

# LabelArtinaButtons
source: Artina Buttons
es_mx: Botones

# LabelCircleImages
source: CircleImages
es_mx: Imagenes Circulares

# LabelArtinaEntry
source: Artina Entry
es_mx: Entrada

# LabelValidationEntryErrorStyle
source: Validation Entry Error Style
es_mx: Estilo de error de validación de entrada

# StringSomethingWrongHere
source: Something wrong here
es_mx: Algo mal aqui

# ValidationErrorEnterRequiredInfo
source: Please enter required information
es_mx: Introduzca información requerida

# ValidationWarningOops
source: Oops! This is just a friendly warning
es_mx: Advertencia amistosa

# StringYourAccount
source: Your Account
es_mx: Tu Cuenta

# StringConnectYourAccount
source: Connect Your Account
es_mx: Conecta tu cuenta

# ImageCellDetailDaysLoggedIn
source: 50 days logged in
es_mx: 50 dias logeado

# EntryCellPlaceholderPhoneNumber
source: Phone number
es_mx: Número de teléfono

# LabelBrandBlock
source: BrandBlock
es_mx: Marca

# LabelBadge
source: Badge
es_mx: Bolsa

# LabelRoundedLabel
source: RoundedLabel
es_mx: Etiqueta Redonda

# RoundedLabelTextSample
source: Grial Rounded Label Sample
es_mx: Etiqueta redondeada

# LabelAboutUsText
source: VS Studio Partner We are a team of passionate UX/UI Designers and Developers with only one mission: help developers make appealing good applications better and faster while we have fun doing what we love.
es_mx: Arquetipo para binaria technologies en xamarin para forms multiplataforma

# OurHistoryString
source: Our Story
es_mx: Nuestra historia

# OurHistoryStringLongText
source: As partners of the greatest IDE ever, we are commited to deliver high quality products that really help devs to achieve their best.
es_mx: Como socios del mejor IDE de la historia, estamos comprometidos a ofrecer productos de alta calidad que realmente ayuden a los desarrolladores a lograr lo mejor.

# LabelWeAreATeamOfPassionate
source: We are a team of passionate UX/UI Designers and Developers with only one mission: help developers make appealing good applications better and faster while we have fun doing what we love.
es_mx: Equipo de apasionados diseñadores

# LabelOurProducts
source: Our Products
es_mx: Nuestros productos

# LabelOurProductsLongText
source: helping developers build better and good looking apps faster since 2015. Stay tunned we have more surprises coming soon…
es_mx: Interfaces unificadas multiplataforma

# LabelSpecialThanks
source: Special thanks
es_mx: Agradecimiento especial

# LabelCredits
source: Credits
es_mx: Créditos

# TabItemTextFriends
source: Friends
es_mx: Amigos

# StringHelloClare
source: Hello Clare!
es_mx: Hola Clare!

# StringNoPendingTasksToday
source: You have no pending tasks today! :)
es_mx: No tienes tareas pendientes por ahora

# ButtonDeleteAccount
source: Delete Account
es_mx: Eliminar Cuenta

# PageTitleEmployeePerformanceDashboard
source: Employee Performance Dashboard
es_mx: Panel de rendimiento del empleado

# PageTitleEmployeeProfileDashboard
source: Employee Profile Details
es_mx: Detalles de perfil de empleado

# PageTitlePerformanceDashboard
source: Performance Dashboard Main
es_mx: Tablero principal de desempeño

# PageTitlePerformanceDashboardMain
source: Performance Dashboard
es_mx: Tablero de desempeño

# PageTitleShippingDetail
source: Shipping Detail
es_mx: Detalle de compra

# PageTitleTaskBrowser
source: Task Browser
es_mx: Explorador de tareas

# PageTitleTaskOverview
source: Task Overview
es_mx: Resúmen de tareas

# PageTitleEmployeeForm
source: Employee Form Page
es_mx: Página de formulario de empleado

# FlowTitleEcommerce
source: Ecommerce Flow
es_mx: Flujo de comercio electrónico

# FlowTitleTasks
source: Tasks Flow
es_mx: Flujo de tareas

# FlowTitleMovies
source: Movies Flow
es_mx: Flujo de peliculas

# FlowTitleMessages
source: Messages Flow
es_mx: Flujo de mensajes

# RichAboutPageDescriptionString
source: We started a small design boutique a few years ago. Our passion fueled our success and suddenly we became the most solicited design firm of San Francisco.
es_mx: somos los mas solicitados en el área

# RichAboutPageTestimonial1String
source: When in need of a great design you know who to call: this team is amazing!
es_mx: Nuestro equipo es increible

# RichAboutPageTestimonial2String
source: Nacho's team did a fantastique work with us!
es_mx: El equipo hizo un fantastico trabajo

# RichAboutPageMissionString
source: Our mission is to create and deliver outstanding designs for our customers. We specialize in food brands, restaurants and fast food chains.
es_mx: Equipo de diseñadores mision 2

# RichAboutPageMission2String
source: We are a team of designers that love UIs, graphic design, books, magazines, lorem ipsum points, picas, DIPs and of course NACHOS!.
es_mx: Equio de diseñadore mision 1

# RichAboutPageFollowUs
source: Follow us on:
es_mx: Siguenos en:

# RichAboutPageEagerToHear
source: If you want to get in touch with us or simply stop by and say hello just ping us! We are eager to hear from you!
es_mx: si deseas mantener contacto solo dinos hola y te buscaremos

# StringAboutUs
source: About Us
es_mx: Acerca de nosotros

# StringOurMission
source: Our Mission
es_mx: Nuestra Misión

# StringOurTeam
source: Our Team
es_mx: Nuestro Equipo

source: Movie Details
es_mx: Detalles de peliculas

source: Team Member
es_mx: Miembro de equipo

source: Tasks performance
es_mx: Desempeño de tareas

source: Shipping Address
es_mx: Dirección de entrega

source: Payment Method
es_mx: Método de pago

source: Buy it
es_mx: Comprarlo

source: Delete Item
es_mx: Eliminar elemento

# OrderWithGift
source: This order contains a gift
es_mx: Esta orden contiene un regalo

source: Related products
es_mx: Productos relacionados

source: See more comments
es_mx: Ver más comentarios

source: See less comments
es_mx: Ver menos comentarios

source: Proceed to checkout
es_mx: Proceder al pago

source: Confirm order
es_mx: Confirmar orden

# OrderPlacedNotification
source: Your order has been placed successfully. Happy shopping!!
es_mx: Tu orden se colocó satisfactoriamente

# StringContacts
source: Contacts
es_mx: Contacto

# StringMessages
source: Messages
es_mx: Mensajes

source: Type your message...
es_mx: Escribe tu mensaje...

# StringEdit
source: Edit
es_mx: Editar

# StringHome
source: Home
es_mx: Inicio

# StringMobile
source: Mobile
es_mx: Movil

# StringMessage
source: Message
es_mx: Mensaje

# PageTitleWelcomeStarter
source: Welcome Starter
es_mx: Bienvenida inicial

# StringRetry
source: Retry
es_mx: Intentar
